Autodesk.Revit.DB.PlanTopology.GetRoomIds
Retrieves room ElementIds of the PlanTopology in the last phase.
Remarks: The Rooms Ids returned are in the phase of PlanTopology and the current design option.
Returns: The PlanTopology Room ElementIds of the last phase.
Since: 2013

Autodesk.Revit.DB.PlanTopology.Phase
The phase of the PlanTopology.

Autodesk.Revit.DB.PlanTopology.Circuits
The Circuits of the PlanTopology.

Autodesk.Revit.DB.PlanTopology.Level
The Level of the PlanTopology.

Autodesk.Revit.DB.PlanTopology
An object that represents a Plan Topology within the Autodesk Revit project.
Remarks: This object derived from the APIObject base object. It can be used access the properties
of a Plan Topology.